ARMmbed/mbed-os/targets/TARGET_Freescale/TARGET_MCUXpresso_MCUS/TARGET_K82F/device/MK82F25615.h
/*
** ###################################################################
**     Processors:          MK82FN256CAx15
**                          MK82FN256VDC15
**                          MK82FN256VLL15
**                          MK82FN256VLQ15
**
**     Compilers:           Keil ARM C/C++ Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**
**     Reference manual:    K82P121M150SF5RM, Rev. 0, May 2015
**     Version:             rev. 1.2, 2015-07-29
**     Build:               b151218
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MK82F25615
**
**     Copyright (c) 1997 - 2015 Freescale Semiconductor, Inc.
**     All rights reserved.
**
**     Redistribution and use in source and binary forms, with or without modification,
**     are permitted provided that the following conditions are met:
**
**     o Redistributions of source code must retain the above copyright notice, this list
**       of conditions and the following disclaimer.
**
**     o Redistributions in binary form must reproduce the above copyright notice, this
**       list of conditions and the following disclaimer in the documentation and/or
**       other materials provided with the distribution.
**
**     o Neither the name of Freescale Semiconductor, Inc. nor the names of its
**       contributors may be used to endorse or promote products derived from this
**       software without specific prior written permission.
**
**     THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
**     ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
**     WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
**     DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
**     ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
**     (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
**     LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
**     ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
**     (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
**     SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
**
**     http:                 www.freescale.com
**     mail:                 support@freescale.com
**
**     Revisions:
**     - rev. 1.0 (2015-04-09)
**         Initial version
**     - rev. 1.1 (2015-05-28)
**         Update according to the reference manual Rev. 0.
**     - rev. 1.2 (2015-07-29)
**         Correction of backward compatibility.
**
** ###################################################################
*/

/*!
 * @file MK82F25615.h
 * @version 1.2
 * @date 2015-07-29
 * @brief CMSIS Peripheral Access Layer for MK82F25615
 *
 * CMSIS Peripheral Access Layer for MK82F25615
 */

#ifndef _MK82F25615_H_
#define _MK82F25615_H_                           /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0100U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0002U

/**
 * @brief Macro to calculate address of an aliased word in the peripheral
 *        bitband area for a peripheral register and bit (bit band region 0x40000000 to
 *        0x400FFFFF).
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return  Address of the aliased word in the peripheral bitband area.
 */
#define BITBAND_REGADDR(Reg,Bit) (0x42000000u + (32u*((uint32_t)&(Reg) - (uint32_t)0x40000000u)) + (4u*((uint32_t)(Bit))))
/**
 * @brief Macro to access a single bit of a peripheral register (bit band region
 *        0x40000000 to 0x400FFFFF) using the bit-band alias region access. Can
 *        be used for peripherals with 32bit access allowed.
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return Value of the targeted bit in the bit band region.
 */
#define BITBAND_REG32(Reg,Bit) (*((uint32_t volatile*)(BITBAND_REGADDR((Reg),(Bit)))))
#define BITBAND_REG(Reg,Bit) (BITBAND_REG32((Reg),(Bit)))
/**
 * @brief Macro to access a single bit of a peripheral register (bit band region
 *        0x40000000 to 0x400FFFFF) using the bit-band alias region access. Can
 *        be used for peripherals with 16bit access allowed.
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return Value of the targeted bit in the bit band region.
 */
#define BITBAND_REG16(Reg,Bit) (*((uint16_t volatile*)(BITBAND_REGADDR((Reg),(Bit)))))
/**
 * @brief Macro to access a single bit of a peripheral register (bit band region
 *        0x40000000 to 0x400FFFFF) using the bit-band alias region access. Can
 *        be used for peripherals with 8bit access allowed.
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return Value of the targeted bit in the bit band region.
 */
#define BITBAND_REG8(Reg,Bit) (*((uint8_t volatile*)(BITBAND_REGADDR((Reg),(Bit)))))

/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 123                /**< Number of interrupts in the Vector table */

typedef enum IRQn {
    /* Auxiliary constants */
    NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

    /* Core interrupts */
    NonMaskableInt_IRQn          = -14,              /**< Non Maskable Interrupt */
    HardFault_IRQn               = -13,              /**< Cortex-M4 SV Hard Fault Interrupt */
    MemoryManagement_IRQn        = -12,              /**< Cortex-M4 Memory Management Interrupt */
    BusFault_IRQn                = -11,              /**< Cortex-M4 Bus Fault Interrupt */
    UsageFault_IRQn              = -10,              /**< Cortex-M4 Usage Fault Interrupt */
    SVCall_IRQn                  = -5,               /**< Cortex-M4 SV Call Interrupt */
    DebugMonitor_IRQn            = -4,               /**< Cortex-M4 Debug Monitor Interrupt */
    PendSV_IRQn                  = -2,               /**< Cortex-M4 Pend SV Interrupt */
    SysTick_IRQn                 = -1,               /**< Cortex-M4 System Tick Interrupt */

    /* Device specific interrupts */
    DMA0_DMA16_IRQn              = 0,                /**< DMA channel 0,16 transfer complete */
    DMA1_DMA17_IRQn              = 1,                /**< DMA channel 1,17 transfer complete */
    DMA2_DMA18_IRQn              = 2,                /**< DMA channel 2,18 transfer complete */
    DMA3_DMA19_IRQn              = 3,                /**< DMA channel 3,19 transfer complete */
    DMA4_DMA20_IRQn              = 4,                /**< DMA channel 4,20 transfer complete */
    DMA5_DMA21_IRQn              = 5,                /**< DMA channel 5,21 transfer complete */
    DMA6_DMA22_IRQn              = 6,                /**< DMA channel 6,22 transfer complete */
    DMA7_DMA23_IRQn              = 7,                /**< DMA channel 7,23 transfer complete */
    DMA8_DMA24_IRQn              = 8,                /**< DMA channel 8,24 transfer complete */
    DMA9_DMA25_IRQn              = 9,                /**< DMA channel 9,25 transfer complete */
    DMA10_DMA26_IRQn             = 10,               /**< DMA channel 10,26 transfer complete */
    DMA11_DMA27_IRQn             = 11,               /**< DMA channel 11,27 transfer complete */
    DMA12_DMA28_IRQn             = 12,               /**< DMA channel 12,28 transfer complete */
    DMA13_DMA29_IRQn             = 13,               /**< DMA channel 13,29 transfer complete */
    DMA14_DMA30_IRQn             = 14,               /**< DMA channel 14,30 transfer complete */
    DMA15_DMA31_IRQn             = 15,               /**< DMA channel 15,31 transfer complete */
    DMA_Error_IRQn               = 16,               /**< DMA channel 0 - 31 error */
    MCM_IRQn                     = 17,               /**< MCM normal interrupt */
    FTFA_IRQn                    = 18,               /**< FTFA command complete */
    Read_Collision_IRQn          = 19,               /**< FTFA read collision */
    LVD_LVW_IRQn                 = 20,               /**< PMC controller low-voltage detect, low-voltage warning */
    LLWU_IRQn                    = 21,               /**< Low leakage wakeup unit */
    WDOG_EWM_IRQn                = 22,               /**< Single interrupt vector for  WDOG and EWM */
    TRNG0_IRQn                   = 23,               /**< True randon number generator */
    I2C0_IRQn                    = 24,               /**< Inter-integrated circuit 0 */
    I2C1_IRQn                    = 25,               /**< Inter-integrated circuit 1 */
    SPI0_IRQn                    = 26,               /**< Serial peripheral Interface 0 */
    SPI1_IRQn                    = 27,               /**< Serial peripheral Interface 1 */
    I2S0_Tx_IRQn                 = 28,               /**< Integrated interchip sound 0 transmit interrupt */
    I2S0_Rx_IRQn                 = 29,               /**< Integrated interchip sound 0 receive interrupt */
    LPUART0_IRQn                 = 30,               /**< LPUART0 receive/transmit/error interrupt */
    LPUART1_IRQn                 = 31,               /**< LPUART1 receive/transmit/error interrupt */
    LPUART2_IRQn                 = 32,               /**< LPUART2 receive/transmit/error interrupt */
    LPUART3_IRQn                 = 33,               /**< LPUART3 receive/transmit/error interrupt */
    LPUART4_IRQn                 = 34,               /**< LPUART4 receive/transmit/error interrupt */
    Reserved51_IRQn              = 35,               /**< Reserved interrupt */
    Reserved52_IRQn              = 36,               /**< Reserved interrupt */
    EMVSIM0_IRQn                 = 37,               /**< EMVSIM0 common interrupt */
    EMVSIM1_IRQn                 = 38,               /**< EMVSIM1 common interrupt */
    ADC0_IRQn                    = 39,               /**< Analog-to-digital converter 0 */
    CMP0_IRQn                    = 40,               /**< Comparator 0 */
    CMP1_IRQn                    = 41,               /**< Comparator 1 */
    FTM0_IRQn                    = 42,               /**< FlexTimer module 0 fault, overflow and channels interrupt */
    FTM1_IRQn                    = 43,               /**< FlexTimer module 1 fault, overflow and channels interrupt */
    FTM2_IRQn                    = 44,               /**< FlexTimer module 2 fault, overflow and channels interrupt */
    CMT_IRQn                     = 45,               /**< Carrier modulator transmitter */
    RTC_IRQn                     = 46,               /**< Real time clock */
    RTC_Seconds_IRQn             = 47,               /**< Real time clock seconds */
    PIT0CH0_IRQn                 = 48,               /**< Periodic interrupt timer 0 channel 0 */
    PIT0CH1_IRQn                 = 49,               /**< Periodic interrupt timer 0 channel 1 */
    PIT0CH2_IRQn                 = 50,               /**< Periodic interrupt timer 0 channel 2 */
    PIT0CH3_IRQn                 = 51,               /**< Periodic interrupt timer 0 channel 3 */
    PDB0_IRQn                    = 52,               /**< Programmable delay block */
    USB0_IRQn                    = 53,               /**< USB OTG interrupt */
    USBDCD_IRQn                  = 54,               /**< USB charger detect */
    Reserved71_IRQn              = 55,               /**< Reserved interrupt */
    DAC0_IRQn                    = 56,               /**< Digital-to-analog converter 0 */
    MCG_IRQn                     = 57,               /**< Multipurpose clock generator */
    LPTMR0_LPTMR1_IRQn           = 58,               /**< Single interrupt vector for  Low Power Timer 0 and 1 */
    PORTA_IRQn                   = 59,               /**< Port A pin detect interrupt */
    PORTB_IRQn                   = 60,               /**< Port B pin detect interrupt */
    PORTC_IRQn                   = 61,               /**< Port C pin detect interrupt */
    PORTD_IRQn                   = 62,               /**< Port D pin detect interrupt */
    PORTE_IRQn                   = 63,               /**< Port E pin detect interrupt */
    SWI_IRQn                     = 64,               /**< Software interrupt */
    SPI2_IRQn                    = 65,               /**< Serial peripheral Interface 2 */
    Reserved82_IRQn              = 66,               /**< Reserved interrupt */
    Reserved83_IRQn              = 67,               /**< Reserved interrupt */
    Reserved84_IRQn              = 68,               /**< Reserved interrupt */
    Reserved85_IRQn              = 69,               /**< Reserved interrupt */
    FLEXIO0_IRQn                 = 70,               /**< FLEXIO0 */
    FTM3_IRQn                    = 71,               /**< FlexTimer module 3 fault, overflow and channels interrupt */
    Reserved88_IRQn              = 72,               /**< Reserved interrupt */
    Reserved89_IRQn              = 73,               /**< Reserved interrupt */
    I2C2_IRQn                    = 74,               /**< Inter-integrated circuit 2 */
    Reserved91_IRQn              = 75,               /**< Reserved interrupt */
    Reserved92_IRQn              = 76,               /**< Reserved interrupt */
    Reserved93_IRQn              = 77,               /**< Reserved interrupt */
    Reserved94_IRQn              = 78,               /**< Reserved interrupt */
    Reserved95_IRQn              = 79,               /**< Reserved interrupt */
    Reserved96_IRQn              = 80,               /**< Reserved interrupt */
    SDHC_IRQn                    = 81,               /**< Secured digital host controller */
    Reserved98_IRQn              = 82,               /**< Reserved interrupt */
    Reserved99_IRQn              = 83,               /**< Reserved interrupt */
    Reserved100_IRQn             = 84,               /**< Reserved interrupt */
    Reserved101_IRQn             = 85,               /**< Reserved interrupt */
    Reserved102_IRQn             = 86,               /**< Reserved interrupt */
    TSI0_IRQn                    = 87,               /**< Touch Sensing Input */
    TPM1_IRQn                    = 88,               /**< TPM1 single interrupt vector for all sources */
    TPM2_IRQn                    = 89,               /**< TPM2 single interrupt vector for all sources */
    Reserved106_IRQn             = 90,               /**< Reserved interrupt */
    I2C3_IRQn                    = 91,               /**< Inter-integrated circuit 3 */
    Reserved108_IRQn             = 92,               /**< Reserved interrupt */
    Reserved109_IRQn             = 93,               /**< Reserved interrupt */
    Reserved110_IRQn             = 94,               /**< Reserved interrupt */
    Reserved111_IRQn             = 95,               /**< Reserved interrupt */
    Reserved112_IRQn             = 96,               /**< Reserved interrupt */
    Reserved113_IRQn             = 97,               /**< Reserved interrupt */
    Reserved114_IRQn             = 98,               /**< Reserved interrupt */
    Reserved115_IRQn             = 99,               /**< Reserved interrupt */
    QuadSPI0_IRQn                = 100,              /**< qspi */
    Reserved117_IRQn             = 101,              /**< Reserved interrupt */
    Reserved118_IRQn             = 102,              /**< Reserved interrupt */
    Reserved119_IRQn             = 103,              /**< Reserved interrupt */
    LTC0_IRQn                    = 104,              /**< LP Trusted Cryptography */
    Reserved121_IRQn             = 105,              /**< Reserved interrupt */
    Reserved122_IRQn             = 106               /**< Reserved interrupt */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Cortex M4 Core Configuration
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Cortex_Core_Configuration Cortex M4 Core Configuration
 * @{
 */

#define __MPU_PRESENT                  0         /**< Defines if an MPU is present or not */
#define __NVIC_PRIO_BITS               4         /**< Number of priority bits implemented in the NVIC */
#define __Vendor_SysTickConfig         0         /**< Vendor specific implementation of SysTickConfig is defined */
#define __FPU_PRESENT                  1         /**< Defines if an FPU is present or not */

#include "core_cm4.h"                  /* Core Peripheral Access Layer */
#include "system_MK82F25615.h"         /* Device specific configuration file */

/*!
 * @}
 */ /* end of group Cortex_Core_Configuration */


/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
/*!
 * @addtogroup edma_request
 * @{
 */

