ARMmbed/mbed-os/targets/TARGET_Freescale/TARGET_MCUXpresso_MCUS/TARGET_K82F/device/MK82F25615.h
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections. The user can configure the
 * hardware request into DMAMUX to trigger the DMA transfer accordingly. The index
 * of the hardware request varies according  to the to SoC.
 */
typedef enum _dma_request_source {
    kDmaRequestMux0Disable          = 0 | 0x100U,  /**< DMAMUX TriggerDisabled. */
    kDmaRequestMux0TSI0             = 1 | 0x100U,  /**< TSI0. */
    kDmaRequestMux0LPUART0Rx        = 2 | 0x100U,  /**< LPUART0 Receive. */
    kDmaRequestMux0LPUART0Tx        = 3 | 0x100U,  /**< LPUART0 Transmit. */
    kDmaRequestMux0LPUART1Rx        = 4 | 0x100U,  /**< LPUART1 Receive. */
    kDmaRequestMux0LPUART1Tx        = 5 | 0x100U,  /**< LPUART1 Transmit. */
    kDmaRequestMux0LPUART2Rx        = 6 | 0x100U,  /**< LPUART2 Receive. */
    kDmaRequestMux0LPUART2Tx        = 7 | 0x100U,  /**< LPUART2 Transmit. */
    kDmaRequestMux0LPUART3Rx        = 8 | 0x100U,  /**< LPUART3 Receive. */
    kDmaRequestMux0LPUART3Tx        = 9 | 0x100U,  /**< LPUART3 Transmit. */
    kDmaRequestMux0LPUART4Rx        = 10 | 0x100U, /**< LPUART4 Receive. */
    kDmaRequestMux0LPUART4Tx        = 11 | 0x100U, /**< LPUART4 Transmit. */
    kDmaRequestMux0I2S0Rx           = 12 | 0x100U, /**< I2S0 Receive. */
    kDmaRequestMux0I2S0Tx           = 13 | 0x100U, /**< I2S0 Transmit. */
    kDmaRequestMux0SPI0Rx           = 14 | 0x100U, /**< SPI0 Receive. */
    kDmaRequestMux0SPI0Tx           = 15 | 0x100U, /**< SPI0 Transmit. */
    kDmaRequestMux0SPI1Rx           = 16 | 0x100U, /**< SPI1 Receive. */
    kDmaRequestMux0SPI1Tx           = 17 | 0x100U, /**< SPI1 Transmit. */
    kDmaRequestMux0I2C0I2C3         = 18 | 0x100U, /**< I2C0 and I2C3. */
    kDmaRequestMux0I2C0             = 18 | 0x100U, /**< I2C0 and I2C3. */
    kDmaRequestMux0I2C3             = 18 | 0x100U, /**< I2C0 and I2C3. */
    kDmaRequestMux0I2C1I2C2         = 19 | 0x100U, /**< I2C1 and I2C2. */
    kDmaRequestMux0I2C1             = 19 | 0x100U, /**< I2C1 and I2C2. */
    kDmaRequestMux0I2C2             = 19 | 0x100U, /**< I2C1 and I2C2. */
    kDmaRequestMux0FTM0Channel0     = 20 | 0x100U, /**< FTM0 C0V. */
    kDmaRequestMux0FTM0Channel1     = 21 | 0x100U, /**< FTM0 C1V. */
    kDmaRequestMux0FTM0Channel2     = 22 | 0x100U, /**< FTM0 C2V. */
    kDmaRequestMux0FTM0Channel3     = 23 | 0x100U, /**< FTM0 C3V. */
    kDmaRequestMux0FTM0Channel4     = 24 | 0x100U, /**< FTM0 C4V. */
    kDmaRequestMux0FTM0Channel5     = 25 | 0x100U, /**< FTM0 C5V. */
    kDmaRequestMux0FTM0Channel6     = 26 | 0x100U, /**< FTM0 C6V. */
    kDmaRequestMux0FTM0Channel7     = 27 | 0x100U, /**< FTM0 C7V. */
    kDmaRequestMux0FTM1Channel0     = 28 | 0x100U, /**< FTM1 C0V. */
    kDmaRequestMux0FTM1Channel1     = 29 | 0x100U, /**< FTM1 C1V. */
    kDmaRequestMux0FTM2Channel0     = 30 | 0x100U, /**< FTM2 C0V. */
    kDmaRequestMux0FTM2Channel1     = 31 | 0x100U, /**< FTM2 C1V. */
    kDmaRequestMux0FTM3Channel0     = 32 | 0x100U, /**< FTM3 C0V. */
    kDmaRequestMux0FTM3Channel1     = 33 | 0x100U, /**< FTM3 C1V. */
    kDmaRequestMux0FTM3Channel2     = 34 | 0x100U, /**< FTM3 C2V. */
    kDmaRequestMux0FTM3Channel3     = 35 | 0x100U, /**< FTM3 C3V. */
    kDmaRequestMux0FTM3Channel4     = 36 | 0x100U, /**< FTM3 C4V. */
    kDmaRequestMux0FTM3Channel5     = 37 | 0x100U, /**< FTM3 C5V. */
    kDmaRequestMux0FTM3Channel6     = 38 | 0x100U, /**< FTM3 C6V. */
    kDmaRequestMux0FTM3Channel7     = 39 | 0x100U, /**< FTM3 C7V. */
    kDmaRequestMux0ADC0             = 40 | 0x100U, /**< ADC0. */
    kDmaRequestMux0Reserved41       = 41 | 0x100U, /**< Reserved41 */
    kDmaRequestMux0CMP0             = 42 | 0x100U, /**< CMP0. */
    kDmaRequestMux0CMP1             = 43 | 0x100U, /**< CMP1. */
    kDmaRequestMux0Reserved44       = 44 | 0x100U, /**< Reserved44 */
    kDmaRequestMux0DAC0             = 45 | 0x100U, /**< DAC0. */
    kDmaRequestMux0Reserved46       = 46 | 0x100U, /**< Reserved46 */
    kDmaRequestMux0CMT              = 47 | 0x100U, /**< CMT. */
    kDmaRequestMux0PDB              = 48 | 0x100U, /**< PDB0. */
    kDmaRequestMux0PortA            = 49 | 0x100U, /**< PTA. */
    kDmaRequestMux0PortB            = 50 | 0x100U, /**< PTB. */
    kDmaRequestMux0PortC            = 51 | 0x100U, /**< PTC. */
    kDmaRequestMux0PortD            = 52 | 0x100U, /**< PTD. */
    kDmaRequestMux0PortE            = 53 | 0x100U, /**< PTE. */
    kDmaRequestMux0Reserved54       = 54 | 0x100U, /**< Reserved54 */
    kDmaRequestMux0Reserved55       = 55 | 0x100U, /**< Reserved55 */
    kDmaRequestMux0Reserved56       = 56 | 0x100U, /**< Reserved56 */
    kDmaRequestMux0Reserved57       = 57 | 0x100U, /**< Reserved57 */
    kDmaRequestMux0SPI2Rx           = 58 | 0x100U, /**< SPI2 Receive. */
    kDmaRequestMux0SPI2Tx           = 59 | 0x100U, /**< SPI2 Transmit. */
    kDmaRequestMux0AlwaysOn60       = 60 | 0x100U, /**< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn61       = 61 | 0x100U, /**< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn62       = 62 | 0x100U, /**< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn63       = 63 | 0x100U, /**< DMAMUX Always Enabled slot. */
    kDmaRequestMux0Group1Disable    = 0 | 0x200U,  /**< DMAMUX TriggerDisabled. */
    kDmaRequestMux0Group1FlexIO0Channel0 = 1 | 0x200U, /**< FLEXIO0. */
    kDmaRequestMux0Group1FlexIO0Channel1 = 2 | 0x200U, /**< FLEXIO0. */
    kDmaRequestMux0Group1FlexIO0Channel2 = 3 | 0x200U, /**< FLEXIO0. */
    kDmaRequestMux0Group1FlexIO0Channel3 = 4 | 0x200U, /**< FLEXIO0. */
    kDmaRequestMux0Group1FlexIO0Channel4 = 5 | 0x200U, /**< FLEXIO0. */
    kDmaRequestMux0Group1FlexIO0Channel5 = 6 | 0x200U, /**< FLEXIO0. */
    kDmaRequestMux0Group1FlexIO0Channel6 = 7 | 0x200U, /**< FLEXIO0. */
    kDmaRequestMux0Group1FlexIO0Channel7 = 8 | 0x200U, /**< FLEXIO0. */
    kDmaRequestMux0Group1Reserved9  = 9 | 0x200U,  /**< Reserved9 */
    kDmaRequestMux0Group1Reserved10 = 10 | 0x200U, /**< Reserved10 */
    kDmaRequestMux0Group1Reserved11 = 11 | 0x200U, /**< Reserved11 */
    kDmaRequestMux0Group1Reserved12 = 12 | 0x200U, /**< Reserved12 */
    kDmaRequestMux0Group1Reserved13 = 13 | 0x200U, /**< Reserved13 */
    kDmaRequestMux0Group1Reserved14 = 14 | 0x200U, /**< Reserved14 */
    kDmaRequestMux0Group1Reserved15 = 15 | 0x200U, /**< Reserved15 */
    kDmaRequestMux0Group1Reserved16 = 16 | 0x200U, /**< Reserved16 */
    kDmaRequestMux0Group1LTC0InputFIFO = 17 | 0x200U, /**< LTC0 Input FIFO. */
    kDmaRequestMux0Group1LTC0OutputFIFO = 18 | 0x200U, /**< LTC0 Output FIFO. */
    kDmaRequestMux0Group1LTC0PKHA   = 19 | 0x200U, /**< LTC0 PKHA. */
    kDmaRequestMux0Group1EMVSIM0Rx  = 20 | 0x200U, /**< EMVSIM0 Receive. */
    kDmaRequestMux0Group1EMVSIM0Tx  = 21 | 0x200U, /**< EMVSIM0 Transmit. */
    kDmaRequestMux0Group1EMVSIM1Rx  = 22 | 0x200U, /**< EMVSIM1 Receive. */
    kDmaRequestMux0Group1EMVSIM1Tx  = 23 | 0x200U, /**< EMVSIM1 Transmit. */
    kDmaRequestMux0Group1QSPI0Rx    = 24 | 0x200U, /**< QuadSPI0 Receive. */
    kDmaRequestMux0Group1QSPI0Tx    = 25 | 0x200U, /**< QuadSPI0 Transmit. */
    kDmaRequestMux0Group1Reserved26 = 26 | 0x200U, /**< Reserved26 */
    kDmaRequestMux0Group1Reserved27 = 27 | 0x200U, /**< Reserved27 */
    kDmaRequestMux0Group1SPI0Rx     = 28 | 0x200U, /**< SPI0 Receive. */
    kDmaRequestMux0Group1SPI0Tx     = 29 | 0x200U, /**< SPI0 Transmit. */
    kDmaRequestMux0Group1SPI1Rx     = 30 | 0x200U, /**< SPI1 Receive. */
    kDmaRequestMux0Group1SPI1Tx     = 31 | 0x200U, /**< SPI1 Transmit. */
    kDmaRequestMux0Group1Reserved32 = 32 | 0x200U, /**< Reserved32 */
    kDmaRequestMux0Group1Reserved33 = 33 | 0x200U, /**< Reserved33 */
    kDmaRequestMux0Group1Reserved34 = 34 | 0x200U, /**< Reserved34 */
    kDmaRequestMux0Group1Reserved35 = 35 | 0x200U, /**< Reserved35 */
    kDmaRequestMux0Group1Reserved36 = 36 | 0x200U, /**< Reserved36 */
    kDmaRequestMux0Group1Reserved37 = 37 | 0x200U, /**< Reserved37 */
    kDmaRequestMux0Group1Reserved38 = 38 | 0x200U, /**< Reserved38 */
    kDmaRequestMux0Group1Reserved39 = 39 | 0x200U, /**< Reserved39 */
    kDmaRequestMux0Group1Reserved40 = 40 | 0x200U, /**< Reserved40 */
    kDmaRequestMux0Group1Reserved41 = 41 | 0x200U, /**< Reserved41 */
    kDmaRequestMux0Group1TPM1Channel0 = 42 | 0x200U, /**< TPM1 C0V. */
    kDmaRequestMux0Group1TPM1Channel1 = 43 | 0x200U, /**< TPM1 C1V. */
    kDmaRequestMux0Group1TPM2Channel0 = 44 | 0x200U, /**< TPM2 C0V. */
    kDmaRequestMux0Group1TPM2Channel1 = 45 | 0x200U, /**< TPM2 C1V. */
    kDmaRequestMux0Group1Reserved46 = 46 | 0x200U, /**< Reserved46 */
    kDmaRequestMux0Group1Reserved47 = 47 | 0x200U, /**< Reserved47 */
    kDmaRequestMux0Group1Reserved48 = 48 | 0x200U, /**< Reserved48 */
    kDmaRequestMux0Group1Reserved49 = 49 | 0x200U, /**< Reserved49 */
    kDmaRequestMux0Group1Reserved50 = 50 | 0x200U, /**< Reserved50 */
    kDmaRequestMux0Group1Reserved51 = 51 | 0x200U, /**< Reserved51 */
    kDmaRequestMux0Group1Reserved52 = 52 | 0x200U, /**< Reserved52 */
    kDmaRequestMux0Group1Reserved53 = 53 | 0x200U, /**< Reserved53 */
    kDmaRequestMux0Group1Reserved54 = 54 | 0x200U, /**< Reserved54 */
    kDmaRequestMux0Group1TPM1Overflow = 55 | 0x200U, /**< TPM1. */
    kDmaRequestMux0Group1TPM2Overflow = 56 | 0x200U, /**< TPM2. */
    kDmaRequestMux0Group1Reserved57 = 57 | 0x200U, /**< Reserved57 */
    kDmaRequestMux0Group1Reserved58 = 58 | 0x200U, /**< Reserved58 */
    kDmaRequestMux0Group1Reserved59 = 59 | 0x200U, /**< Reserved59 */
    kDmaRequestMux0Group1AlwaysOn60 = 60 | 0x200U, /**< DMAMUX Always Enabled slot. */
    kDmaRequestMux0Group1AlwaysOn61 = 61 | 0x200U, /**< DMAMUX Always Enabled slot. */
    kDmaRequestMux0Group1AlwaysOn62 = 62 | 0x200U, /**< DMAMUX Always Enabled slot. */
    kDmaRequestMux0Group1AlwaysOn63 = 63 | 0x200U, /**< DMAMUX Always Enabled slot. */
} dma_request_source_t;

/* @} */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


